; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob28) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate12)
	(at pallet1 depot1)
	(clear crate3)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate10)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor1)
	(clear pallet6)
	(at pallet7 distributor0)
	(clear crate6)
	(at pallet8 depot0)
	(clear crate11)
	(at pallet9 distributor2)
	(clear crate8)
	(at pallet10 distributor1)
	(clear crate4)
	(at pallet11 depot1)
	(clear pallet11)
	(at truck0 depot1)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 depot1)
	(available hoist7)
	(at crate0 depot1)
	(on crate0 pallet1)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 distributor0)
	(on crate2 pallet3)
	(at crate3 depot1)
	(on crate3 crate0)
	(at crate4 distributor1)
	(on crate4 pallet10)
	(at crate5 distributor0)
	(on crate5 crate2)
	(at crate6 distributor0)
	(on crate6 pallet7)
	(at crate7 distributor0)
	(on crate7 crate5)
	(at crate8 distributor2)
	(on crate8 pallet9)
	(at crate9 depot0)
	(on crate9 pallet8)
	(at crate10 distributor0)
	(on crate10 crate7)
	(at crate11 depot0)
	(on crate11 crate9)
	(at crate12 depot0)
	(on crate12 crate1)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 crate0)
		(on crate2 crate12)
		(on crate3 crate6)
		(on crate4 pallet2)
		(on crate6 pallet3)
		(on crate7 pallet11)
		(on crate8 crate3)
		(on crate9 crate4)
		(on crate10 crate9)
		(on crate11 pallet4)
		(on crate12 crate7)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 12
2. (lift hoist0 crate11 crate9 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate9)
   added: (lifting hoist0 crate11) (clear crate9)
   goals met: 0 of 12
3. (load hoist0 crate11 truck1 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck1) (available hoist0)
   goals met: 0 of 12
4. (lift hoist6 crate12 crate1 depot0)
   deleted: (at crate12 depot0) (clear crate12) (available hoist6) (on crate12 crate1)
   added: (lifting hoist6 crate12) (clear crate1)
   goals met: 0 of 12
5. (load hoist6 crate12 truck1 depot0)
   deleted: (lifting hoist6 crate12)
   added: (in crate12 truck1) (available hoist6)
   goals met: 0 of 12
6. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 12
7. (lift hoist6 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist6) (on crate1 pallet0)
   added: (lifting hoist6 crate1) (clear pallet0)
   goals met: 0 of 12
8. (lift hoist7 crate3 crate0 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist7) (on crate3 crate0)
   added: (lifting hoist7 crate3) (clear crate0)
   goals met: 0 of 12
9. (load hoist7 crate3 truck0 depot1)
   deleted: (lifting hoist7 crate3)
   added: (in crate3 truck0) (available hoist7)
   goals met: 0 of 12
10. (lift hoist7 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist7) (on crate0 pallet1)
   added: (lifting hoist7 crate0) (clear pallet1)
   goals met: 0 of 12
11. (load hoist7 crate0 truck0 depot1)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck0) (available hoist7)
   goals met: 0 of 12
12. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 0 of 12
13. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 0 of 12
14. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 0 of 12
15. (drop hoist0 crate0 pallet0 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet0)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet0)
   goals met: 1 of 12
16. (drop hoist6 crate1 crate0 depot0)
   deleted: (lifting hoist6 crate1) (clear crate0)
   added: (available hoist6) (at crate1 depot0) (clear crate1) (on crate1 crate0)
   goals met: 2 of 12
17. (lift hoist6 crate9 pallet8 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist6) (on crate9 pallet8)
   added: (lifting hoist6 crate9) (clear pallet8)
   goals met: 2 of 12
18. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 2 of 12
19. (load hoist6 crate9 truck0 depot0)
   deleted: (lifting hoist6 crate9)
   added: (in crate9 truck0) (available hoist6)
   goals met: 2 of 12
20. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 2 of 12
21. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 2 of 12
22. (unload hoist4 crate11 truck1 distributor1)
   deleted: (in crate11 truck1) (available hoist4)
   added: (lifting hoist4 crate11)
   goals met: 2 of 12
23. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 2 of 12
24. (drop hoist4 crate11 pallet4 distributor1)
   deleted: (lifting hoist4 crate11) (clear pallet4)
   added: (available hoist4) (at crate11 distributor1) (clear crate11) (on crate11 pallet4)
   goals met: 3 of 12
25. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 3 of 12
26. (unload hoist4 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist4)
   added: (lifting hoist4 crate9)
   goals met: 3 of 12
27. (drop hoist4 crate9 crate4 distributor1)
   deleted: (lifting hoist4 crate9) (clear crate4)
   added: (available hoist4) (at crate9 distributor1) (clear crate9) (on crate9 crate4)
   goals met: 4 of 12
28. (lift hoist5 crate8 pallet9 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 pallet9)
   added: (lifting hoist5 crate8) (clear pallet9)
   goals met: 4 of 12
29. (unload hoist4 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist4)
   added: (lifting hoist4 crate3)
   goals met: 4 of 12
30. (drop hoist4 crate3 pallet6 distributor1)
   deleted: (lifting hoist4 crate3) (clear pallet6)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 pallet6)
   goals met: 4 of 12
31. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 4 of 12
32. (load hoist5 crate8 truck0 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck0) (available hoist5)
   goals met: 4 of 12
33. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 4 of 12
34. (unload hoist4 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist4)
   added: (lifting hoist4 crate8)
   goals met: 4 of 12
35. (drop hoist4 crate8 crate3 distributor1)
   deleted: (lifting hoist4 crate8) (clear crate3)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 crate3)
   goals met: 5 of 12
36. (lift hoist3 crate10 crate7 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist3) (on crate10 crate7)
   added: (lifting hoist3 crate10) (clear crate7)
   goals met: 5 of 12
37. (load hoist3 crate10 truck1 distributor0)
   deleted: (lifting hoist3 crate10)
   added: (in crate10 truck1) (available hoist3)
   goals met: 5 of 12
38. (unload hoist3 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist3)
   added: (lifting hoist3 crate12)
   goals met: 5 of 12
39. (drop hoist3 crate12 crate7 distributor0)
   deleted: (lifting hoist3 crate12) (clear crate7)
   added: (available hoist3) (at crate12 distributor0) (clear crate12) (on crate12 crate7)
   goals met: 6 of 12
40. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 6 of 12
41. (unload hoist4 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist4)
   added: (lifting hoist4 crate10)
   goals met: 6 of 12
42. (drop hoist4 crate10 crate9 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate9)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate9)
   goals met: 7 of 12
43. (lift hoist4 crate8 crate3 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist4) (on crate8 crate3)
   added: (lifting hoist4 crate8) (clear crate3)
   goals met: 6 of 12
44. (load hoist4 crate8 truck0 distributor1)
   deleted: (lifting hoist4 crate8)
   added: (in crate8 truck0) (available hoist4)
   goals met: 6 of 12
45. (lift hoist4 crate3 pallet6 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 pallet6)
   added: (lifting hoist4 crate3) (clear pallet6)
   goals met: 6 of 12
46. (load hoist4 crate3 truck0 distributor1)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck0) (available hoist4)
   goals met: 6 of 12
47. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 6 of 12
48. (unload hoist3 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist3)
   added: (lifting hoist3 crate3)
   goals met: 6 of 12
49. (drop hoist3 crate3 crate6 distributor0)
   deleted: (lifting hoist3 crate3) (clear crate6)
   added: (available hoist3) (at crate3 distributor0) (clear crate3) (on crate3 crate6)
   goals met: 7 of 12
50. (unload hoist3 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist3)
   added: (lifting hoist3 crate8)
   goals met: 7 of 12
51. (drop hoist3 crate8 crate3 distributor0)
   deleted: (lifting hoist3 crate8) (clear crate3)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 crate3)
   goals met: 8 of 12
52. (lift hoist3 crate12 crate7 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist3) (on crate12 crate7)
   added: (lifting hoist3 crate12) (clear crate7)
   goals met: 7 of 12
53. (drop hoist3 crate12 crate8 distributor0)
   deleted: (lifting hoist3 crate12) (clear crate8)
   added: (available hoist3) (at crate12 distributor0) (clear crate12) (on crate12 crate8)
   goals met: 7 of 12
54. (lift hoist3 crate7 crate5 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist3) (on crate7 crate5)
   added: (lifting hoist3 crate7) (clear crate5)
   goals met: 7 of 12
55. (load hoist3 crate7 truck0 distributor0)
   deleted: (lifting hoist3 crate7)
   added: (in crate7 truck0) (available hoist3)
   goals met: 7 of 12
56. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 7 of 12
57. (unload hoist7 crate7 truck0 depot1)
   deleted: (in crate7 truck0) (available hoist7)
   added: (lifting hoist7 crate7)
   goals met: 7 of 12
58. (drop hoist7 crate7 pallet11 depot1)
   deleted: (lifting hoist7 crate7) (clear pallet11)
   added: (available hoist7) (at crate7 depot1) (clear crate7) (on crate7 pallet11)
   goals met: 8 of 12
59. (lift hoist3 crate12 crate8 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist3) (on crate12 crate8)
   added: (lifting hoist3 crate12) (clear crate8)
   goals met: 8 of 12
60. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 8 of 12
61. (load hoist3 crate12 truck1 distributor0)
   deleted: (lifting hoist3 crate12)
   added: (in crate12 truck1) (available hoist3)
   goals met: 8 of 12
62. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 8 of 12
63. (unload hoist7 crate12 truck1 depot1)
   deleted: (in crate12 truck1) (available hoist7)
   added: (lifting hoist7 crate12)
   goals met: 8 of 12
64. (drop hoist7 crate12 crate7 depot1)
   deleted: (lifting hoist7 crate12) (clear crate7)
   added: (available hoist7) (at crate12 depot1) (clear crate12) (on crate12 crate7)
   goals met: 9 of 12
65. (lift hoist3 crate5 crate2 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 crate2)
   added: (lifting hoist3 crate5) (clear crate2)
   goals met: 9 of 12
66. (drop hoist3 crate5 crate8 distributor0)
   deleted: (lifting hoist3 crate5) (clear crate8)
   added: (available hoist3) (at crate5 distributor0) (clear crate5) (on crate5 crate8)
   goals met: 9 of 12
67. (lift hoist3 crate2 pallet3 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist3) (on crate2 pallet3)
   added: (lifting hoist3 crate2) (clear pallet3)
   goals met: 9 of 12
68. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 9 of 12
69. (load hoist3 crate2 truck1 distributor0)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck1) (available hoist3)
   goals met: 9 of 12
70. (lift hoist3 crate5 crate8 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 crate8)
   added: (lifting hoist3 crate5) (clear crate8)
   goals met: 9 of 12
71. (load hoist3 crate5 truck1 distributor0)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck1) (available hoist3)
   goals met: 9 of 12
72. (lift hoist3 crate8 crate3 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 crate3)
   added: (lifting hoist3 crate8) (clear crate3)
   goals met: 8 of 12
73. (load hoist3 crate8 truck1 distributor0)
   deleted: (lifting hoist3 crate8)
   added: (in crate8 truck1) (available hoist3)
   goals met: 8 of 12
74. (lift hoist3 crate3 crate6 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist3) (on crate3 crate6)
   added: (lifting hoist3 crate3) (clear crate6)
   goals met: 7 of 12
75. (load hoist3 crate3 truck1 distributor0)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck1) (available hoist3)
   goals met: 7 of 12
76. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 7 of 12
77. (unload hoist7 crate2 truck1 depot1)
   deleted: (in crate2 truck1) (available hoist7)
   added: (lifting hoist7 crate2)
   goals met: 7 of 12
78. (drop hoist7 crate2 crate12 depot1)
   deleted: (lifting hoist7 crate2) (clear crate12)
   added: (available hoist7) (at crate2 depot1) (clear crate2) (on crate2 crate12)
   goals met: 8 of 12
79. (unload hoist7 crate8 truck1 depot1)
   deleted: (in crate8 truck1) (available hoist7)
   added: (lifting hoist7 crate8)
   goals met: 8 of 12
80. (unload hoist1 crate3 truck1 depot1)
   deleted: (in crate3 truck1) (available hoist1)
   added: (lifting hoist1 crate3)
   goals met: 8 of 12
81. (drop hoist1 crate3 pallet1 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 pallet1)
   goals met: 8 of 12
82. (lift hoist3 crate6 pallet7 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist3) (on crate6 pallet7)
   added: (lifting hoist3 crate6) (clear pallet7)
   goals met: 8 of 12
83. (drop hoist3 crate6 pallet3 distributor0)
   deleted: (lifting hoist3 crate6) (clear pallet3)
   added: (available hoist3) (at crate6 distributor0) (clear crate6) (on crate6 pallet3)
   goals met: 9 of 12
84. (lift hoist1 crate3 pallet1 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   goals met: 9 of 12
85. (load hoist1 crate3 truck1 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   goals met: 9 of 12
86. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 9 of 12
87. (unload hoist3 crate3 truck1 distributor0)
   deleted: (in crate3 truck1) (available hoist3)
   added: (lifting hoist3 crate3)
   goals met: 9 of 12
88. (drop hoist3 crate3 pallet7 distributor0)
   deleted: (lifting hoist3 crate3) (clear pallet7)
   added: (available hoist3) (at crate3 distributor0) (clear crate3) (on crate3 pallet7)
   goals met: 9 of 12
89. (load hoist7 crate8 truck0 depot1)
   deleted: (lifting hoist7 crate8)
   added: (in crate8 truck0) (available hoist7)
   goals met: 9 of 12
90. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 9 of 12
91. (lift hoist3 crate3 pallet7 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist3) (on crate3 pallet7)
   added: (lifting hoist3 crate3) (clear pallet7)
   goals met: 9 of 12
92. (drop hoist3 crate3 crate6 distributor0)
   deleted: (lifting hoist3 crate3) (clear crate6)
   added: (available hoist3) (at crate3 distributor0) (clear crate3) (on crate3 crate6)
   goals met: 10 of 12
93. (unload hoist3 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist3)
   added: (lifting hoist3 crate8)
   goals met: 10 of 12
94. (drop hoist3 crate8 crate3 distributor0)
   deleted: (lifting hoist3 crate8) (clear crate3)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 crate3)
   goals met: 11 of 12
95. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 11 of 12
96. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 11 of 12
97. (lift hoist4 crate10 crate9 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate9)
   added: (lifting hoist4 crate10) (clear crate9)
   goals met: 10 of 12
98. (load hoist4 crate10 truck0 distributor1)
   deleted: (lifting hoist4 crate10)
   added: (in crate10 truck0) (available hoist4)
   goals met: 10 of 12
99. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 10 of 12
100. (unload hoist0 crate10 truck0 depot0)
   deleted: (in crate10 truck0) (available hoist0)
   added: (lifting hoist0 crate10)
   goals met: 10 of 12
101. (lift hoist4 crate9 crate4 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 crate4)
   added: (lifting hoist4 crate9) (clear crate4)
   goals met: 9 of 12
102. (drop hoist4 crate9 pallet6 distributor1)
   deleted: (lifting hoist4 crate9) (clear pallet6)
   added: (available hoist4) (at crate9 distributor1) (clear crate9) (on crate9 pallet6)
   goals met: 9 of 12
103. (load hoist0 crate10 truck0 depot0)
   deleted: (lifting hoist0 crate10)
   added: (in crate10 truck0) (available hoist0)
   goals met: 9 of 12
104. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 9 of 12
105. (unload hoist4 crate10 truck0 distributor1)
   deleted: (in crate10 truck0) (available hoist4)
   added: (lifting hoist4 crate10)
   goals met: 9 of 12
106. (drop hoist4 crate10 crate9 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate9)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate9)
   goals met: 10 of 12
107. (lift hoist4 crate4 pallet10 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist4) (on crate4 pallet10)
   added: (lifting hoist4 crate4) (clear pallet10)
   goals met: 10 of 12
108. (load hoist4 crate4 truck1 distributor1)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck1) (available hoist4)
   goals met: 10 of 12
109. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 10 of 12
110. (unload hoist2 crate4 truck1 depot2)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   goals met: 10 of 12
111. (drop hoist2 crate4 pallet2 depot2)
   deleted: (lifting hoist2 crate4) (clear pallet2)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 pallet2)
   goals met: 11 of 12
112. (lift hoist4 crate10 crate9 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate9)
   added: (lifting hoist4 crate10) (clear crate9)
   goals met: 10 of 12
113. (load hoist4 crate10 truck0 distributor1)
   deleted: (lifting hoist4 crate10)
   added: (in crate10 truck0) (available hoist4)
   goals met: 10 of 12
114. (lift hoist4 crate9 pallet6 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 pallet6)
   added: (lifting hoist4 crate9) (clear pallet6)
   goals met: 10 of 12
115. (load hoist4 crate9 truck0 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck0) (available hoist4)
   goals met: 10 of 12
116. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 10 of 12
117. (unload hoist2 crate9 truck0 depot2)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   goals met: 10 of 12
118. (drop hoist2 crate9 crate4 depot2)
   deleted: (lifting hoist2 crate9) (clear crate4)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 crate4)
   goals met: 11 of 12
119. (unload hoist2 crate10 truck0 depot2)
   deleted: (in crate10 truck0) (available hoist2)
   added: (lifting hoist2 crate10)
   goals met: 11 of 12
120. (drop hoist2 crate10 crate9 depot2)
   deleted: (lifting hoist2 crate10) (clear crate9)
   added: (available hoist2) (at crate10 depot2) (clear crate10) (on crate10 crate9)
   goals met: 12 of 12
